mariopartyrd/marioparty4/src/REL/m455Dll/stage.c
#include "game/hu3d.h"
#include "game/object.h"
#include "game/objsub.h"


#include "game/frand.h"
#include "game/sprite.h"

#include "REL/m455Dll.h"

#include "ext_math.h"
#include "math.h"
#include "version.h"
#include <string.h>

HUPROCESS *lbl_1_bss_70;
OMOBJ *lbl_1_bss_6C;
OMOBJ *lbl_1_bss_68;
OMOBJ *lbl_1_bss_64;
OMOBJ *lbl_1_bss_60;
OMOBJ *lbl_1_bss_5C;
OMOBJ *lbl_1_bss_58;
Vec lbl_1_bss_4C;

typedef struct struct_bss48 {
    ANIMDATA *unk0[4];
    s32 unk10[4];
    Vec unk20;
} StructBss48;

StructBss48 *lbl_1_bss_48;

Vec lbl_1_data_1D8[4] = {
    { -460, 0, 150 },
    { 460, 0, 150 },
    { -460, 0, -150 },
    { 460, 0, -150 },
};

GXColor lbl_1_data_208 = { 255, 255, 255, 255 };

typedef struct struct_data20C {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    s32 unkC;
    BOOL unk10;
} StructData20C;

StructData20C lbl_1_data_20C[4] = {
    { 400, 400, 400, 400, FALSE },
    { 640, 480, 320, 240, TRUE },
    { 640, 480, 640, 480, FALSE },
    { 640, 480, 320, 240, TRUE },
};

void fn_1_8EAC(void);

void fn_1_6914(OMOBJ *object);
void fn_1_7280(OMOBJ *object);
void fn_1_75C0(OMOBJ *object);
void fn_1_7C48(OMOBJ *object);
void fn_1_891C(OMOBJ *object);

OMOBJ *fn_1_347C(void);

void fn_1_32C4(HUPROCESS *objman)
{
    lbl_1_bss_70 = objman;
    fn_1_8EAC();
    lbl_1_bss_68 = omAddObjEx(lbl_1_bss_70, 50, 0, 0, -1, fn_1_6914);
    lbl_1_bss_64 = omAddObjEx(lbl_1_bss_70, 50, 8, 0, -1, fn_1_7280);
    lbl_1_bss_60 = omAddObjEx(lbl_1_bss_70, 50, 1, 0, -1, fn_1_75C0);
    lbl_1_bss_5C = omAddObjEx(lbl_1_bss_70, 50, 0, 0, -1, fn_1_7C48);
    lbl_1_bss_58 = omAddObjEx(lbl_1_bss_70, 50, 0, 0, -1, fn_1_891C);
    lbl_1_bss_6C = fn_1_347C();
}

void fn_1_4104(OMOBJ *object);

void fn_1_6C60(OMOBJ *object);
void fn_1_7430(OMOBJ *object);
void fn_1_7974(OMOBJ *object);
void fn_1_8474(OMOBJ *object);

void fn_1_9168(void);

void fn_1_340C(void)
{
    fn_1_4104(lbl_1_bss_6C);
    fn_1_9168();
    fn_1_6C60(lbl_1_bss_68);
    fn_1_7430(lbl_1_bss_64);
    fn_1_7974(lbl_1_bss_60);
    fn_1_8474(lbl_1_bss_5C);
}

typedef struct work_347C_unk4 {
    void *unk0;
    u32 unk4;
    BOOL unk8;
    s32 unkC;
    s32 unk10;
    s32 unk14;
    s32 unk18;
} Work347CUnk4;

typedef struct work_347C_unk74 {
    Vec unk0;
    Vec unkC;
    float unk18;
    u16 unk1C;
    u16 unk1E;
} Work347CUnk74;

typedef struct work_347C {
    s32 unk0;
    Work347CUnk4 unk4[4];
    Work347CUnk74 unk74[64];
    float unk874[26][2];
    float unk944[26][2];
    void *unkA14;
    u32 unkA18;
    ANIMDATA *unkA1C[9];
    float unkA40;
    float unkA44;
    u32 unkA48;
    u32 unkA4C;
    u32 unkA50;
    float unkA54;
    float unkA58;
} Work347C;

void fn_1_3DDC(OMOBJ *object);

void fn_1_4180(HU3DMODEL *model, Mtx matrix);
void fn_1_49AC(HU3DMODEL *model, Mtx matrix);
void fn_1_4E64(HU3DMODEL *model, Mtx matrix);

OMOBJ *fn_1_347C(void)
{
    OMOBJ *object = omAddObjEx(lbl_1_bss_70, 127, 15, 0, -1, fn_1_3DDC);
    Work347C *work = object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(Work347C), MEMORY_DEFAULT_NUM);
    Work347C *work2 = work;
    Work347CUnk74 *workUnk74 = &work->unk74[0];
    Work347CUnk4 *workUnk4;
    s32 id;
    HU3DMODEL *modelP;
    s32 i;

    work->unkA40 = 0;
    work->unkA44 = 0;
    work->unkA48 = 0;
    work->unkA4C = 0;
    work->unkA50 = 0;
    work->unkA54 = 0;
    work->unkA58 = 0;

    object->mdlId[0] = id = Hu3DHookFuncCreate(fn_1_4E64);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 5);
    modelP = &Hu3DData[id];
    modelP->hookData = work;
    work->unkA1C[4] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 21), MEMORY_DEFAULT_NUM));
    work->unkA1C[5] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 22), MEMORY_DEFAULT_NUM));
    work->unkA1C[6] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 23), MEMORY_DEFAULT_NUM));
    work->unkA1C[7] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 24), MEMORY_DEFAULT_NUM));
    work->unkA1C[0] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 17), MEMORY_DEFAULT_NUM));
    work->unkA1C[1] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 18), MEMORY_DEFAULT_NUM));
    work->unkA1C[2] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 19), MEMORY_DEFAULT_NUM));
    work->unkA1C[3] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 20), MEMORY_DEFAULT_NUM));
    work->unkA1C[8] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 25), MEMORY_DEFAULT_NUM));
    object->mdlId[1] = id = Hu3DHookFuncCreate(fn_1_4180);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 0);
    modelP = &Hu3DData[id];
    modelP->hookData = work;
    work2->unkA18 = 16384;
    work2->unkA14 = HuMemDirectMallocNum(HEAP_SYSTEM, work2->unkA18, MEMORY_DEFAULT_NUM);
    DCFlushRange(work2->unkA14, 16384);
    GXBeginDisplayList(work2->unkA14, work2->unkA18);
    GXBegin(GX_QUADS, GX_VTXFMT0, 4);
    GXPosition2f32(-0.5f, -0.5f);
    GXTexCoord2f32(0, 0);
    GXPosition2f32(0.5f, -0.5f);
    GXTexCoord2f32(1, 0);
    GXPosition2f32(0.5f, 0.5f);
    GXTexCoord2f32(1, 1);
    GXPosition2f32(-0.5f, 0.5f);
    GXTexCoord2f32(0, 1);
    work2->unkA18 = GXEndDisplayList();
    for(i=0; i<26; i++) {
        work2->unk874[i][0] = 0;
        work2->unk874[i][1] = 0;
        work2->unk944[i][0] = 0;
        work2->unk944[i][1] = 0;
    }

    object->mdlId[3] = id = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 5));
    Hu3DModelPosSet(id, 0, 0, -5000);
    Hu3DModelScaleSet(id, 2, 2, 2);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 1);
    id = Hu3DTexScrollCreate(object->mdlId[3], "S3TCsk");
    Hu3DTexScrollPosMoveSet(id, -0.0055f * REFRESH_FREQ, 0, 0);
    id = Hu3DTexScrollCreate(object->mdlId[3], "pa_sk3");
    Hu3DTexScrollPosMoveSet(id, -0.0125f * REFRESH_FREQ, 0, 0);

    object->mdlId[4] = id = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 6));
    Hu3DModelPosSet(id, 0, 0, -3000);
    Hu3DModelScaleSet(id, 1.2f, 1.2f, 1.2f);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 1);

    object->mdlId[8] = id = Hu3DHookFuncCreate(fn_1_49AC);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 2);
    modelP = &Hu3DData[id];
    modelP->hookData = work;

