mariopartyrd/marioparty4/src/REL/m455Dll/stage.c
    object->mdlId[10] = id = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 0));
    Hu3DModelPosSet(id, 0, 0, 0);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 3);
    Hu3DModelShadowMapSet(object->mdlId[10]);
    for(i=0; i<4; i++) {

        object->mdlId[i+11] = id = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 1));
        Hu3DModelCameraSet(object->mdlId[i+11], HU3D_CAM0);
        Hu3DModelLayerSet(object->mdlId[i+11], 3);
        Hu3DModelPosSet(object->mdlId[i+11], lbl_1_data_1D8[i].x, lbl_1_data_1D8[i].y, lbl_1_data_1D8[i].z);
        Hu3DModelAttrSet(object->mdlId[i+11], HU3D_MOTATTR_SHAPE_LOOP);
        Hu3DMotionShapeTimeSet(object->mdlId[i+11], (0.25*i)*Hu3DMotionShapeMaxTimeGet(object->mdlId[i+11]));
    }
    modelP = &Hu3DData[object->mdlId[0]];
    workUnk4 = &work2->unk4[0];
    for(i=0; i<4; i++, workUnk4++) {
        workUnk4->unkC = lbl_1_data_20C[i].unk0;
        workUnk4->unk10 = lbl_1_data_20C[i].unk4;
        workUnk4->unk14 = lbl_1_data_20C[i].unk8;
        workUnk4->unk18 = lbl_1_data_20C[i].unkC;
        workUnk4->unk8 = lbl_1_data_20C[i].unk10;
        workUnk4->unk4 = GXGetTexBufferSize(workUnk4->unk14, workUnk4->unk18, GX_TF_RGB565, GX_FALSE, GX_FALSE);
        workUnk4->unk0 = HuMemDirectMallocNum(HEAP_DATA, workUnk4->unk4, modelP->mallocNo);
        memset(workUnk4->unk0, 0, workUnk4->unk4);
        DCFlushRange(workUnk4->unk0, workUnk4->unk4);
    }
    for(i=0; i<64; i++, workUnk74++) {
        workUnk74->unk0.x = workUnk74->unk0.y = workUnk74->unk0.z = 0;
        workUnk74->unkC.x = 0;
        workUnk74->unkC.y = 0;
        workUnk74->unkC.z = 1;
        workUnk74->unk18 = REFRESH_FREQ;
        workUnk74->unk1C = REFRESH_RATE;
        workUnk74->unk1E = 0;
    }
    return object;
}

void fn_1_9CFC(float arg0);

void fn_1_3DDC(OMOBJ *object)
{
    Work347C *work = object->data;
    Work347C *work2 = work;
    s32 i;
    if((work->unkA50 = work->unkA50+(0.007874016f*((s32)frand() & 0x7F)*3.0f)) > 360) {
        work->unkA50 -= 360;
    }
    work->unkA44 = (25+work->unkA40)+(5.0*sind(work->unkA50));
    Hu3DModelPosSet(object->mdlId[10], 0, work->unkA44, 0);
    for(i=0; i<4; i++) {
        Hu3DModelPosSet(object->mdlId[i+11], lbl_1_data_1D8[i].x, work->unkA44+lbl_1_data_1D8[i].y, lbl_1_data_1D8[i].z);
    }
    work->unkA54 += 6.0f / (REFRESH_RATE_F * 100.0f);
    work->unkA58 += 6.0f / (REFRESH_RATE_F * 100.0f);
    work->unkA48++;
    work->unkA4C++;
    if(work->unkA4C >= REFRESH_RATE_F && work->unkA4C <= REFRESH_RATE_F * 1.35f) {
        float time = 1 - ((work->unkA4C - REFRESH_RATE_F) / (REFRESH_RATE_F * 0.35f));
        if(time < 0.0f) {
            time = 0.0f;
        }
        fn_1_9CFC(time);
    }
}

void fn_1_4104(OMOBJ *object)
{
    Work347C *work = object->data;
    HuSprAnimKill(work->unkA1C[0]);
    HuSprAnimKill(work->unkA1C[1]);
    HuSprAnimKill(work->unkA1C[2]);
    HuSprAnimKill(work->unkA1C[3]);
    HuSprAnimKill(work->unkA1C[6]);
    HuSprAnimKill(work->unkA1C[7]);
    HuSprAnimKill(work->unkA1C[4]);
    HuSprAnimKill(work->unkA1C[5]);
    HuSprAnimKill(work->unkA1C[8]);
}

GXColor lbl_1_data_26A = { 255, 255, 255, 32 };
GXColor lbl_1_data_26E = { 255, 255, 255, 10 };
GXColor lbl_1_data_272 = { 0, 126, 126, 255 };
Vec lbl_1_data_278[4] = {
    -1000, 50, 1000,
    -1000, 50, -1000,
    1000, 50, -1000,
    1000, 50, 1000
};

Vec lbl_1_data_2A8[26] = {
    -1500, 0, 1000,
    -1400, 0, 1000,
    0, 0, 1000,
    1400, 0, 1000,
    1500, 0, 1000,
    -1500, 0, -500,
    -1400, 0, -500,
    0, 0, -500,
    1400, 0, -500,
    1500, 0, -500,
    -1500, 0, -2000,
    -1400, 0, -2000,
    0, 0, -2000,
    1400, 0, -2000,
    1500, 0, -2000,
    -1500, 0, -5000,
    -1400, 0, -5000,
    0, 0, -5000,
    1400, 0, -5000,
    1500, 0, -5000,
    -2000, 0, -500,
    -2500, 0, -2000,
    -3000, 0, -5000,
    2000, 0, -500,
    2500, 0, -2000,
    3000, 0, -5000
};

GXColor lbl_1_data_3E0[26] = {
    { 96, 128, 255, 255 },
    { 128, 160, 255, 32 },
    { 128, 160, 255, 32 },
    { 128, 160, 255, 32 },
    { 96, 128, 255, 255 },
    { 24, 48, 255, 255 },
    { 96, 128, 255, 32 },
    { 128, 160, 255, 32 },
    { 96, 128, 255, 32 },
    { 24, 48, 255, 255 },
    { 24, 48, 255, 255 },
    { 24, 48, 255, 255 },
    { 96, 128, 255, 255 },
    { 24, 48, 255, 255 },
    { 24, 48, 255, 255 },
    { 8, 24, 143, 255 },
    { 8, 24, 143, 255 },
    { 8, 24, 143, 255 },
    { 8, 24, 143, 255 },
    { 8, 24, 143, 255 },
    { 24, 48, 255, 255 },
    { 24, 48, 255, 255 },
    { 24, 48, 255, 255 },
    { 24, 48, 255, 255 },
    { 24, 48, 255, 255 },
    { 24, 48, 255, 255 }
};

float lbl_1_data_448[26][2] = {
    0, 1,
    0.033333335, 1,
    0.5, 1,
    0.96666664, 1,
    1, 1,
    0, 0.5,
    0.033333335, 0.5,
    0.5, 0.5,
    0.96666664, 0.5,
    1, 0.5,
    0, 0,
    0.033333335, 0,
    0.5, 0,
    0.96666664, 0,
    1, 0,
    0, 0,
    0.033333335, 0,
    0.5, 0,
    0.96666664, 0,
    1, 0,
    -0.15, 0.5,
    -0.33, 0,
    -0.49, 0,
    1.15, 0.5,
    1.33, 0,
    1.49, 0
};

float lbl_1_data_518[26][2] = {
    0, 30,
    0.5, 30,
    7.5, 30,
    14.5, 30,
    15, 30,
    0, 15,
    0.5, 15,
    7.5, 15,
    14.5, 15,
    15, 15,
    0, 7.5,
    0.5, 7.5,
    7.5, 7.5,
    14.5, 7.5,
    15, 7.5,
    0, 0,
    0.5, 0,
    7.5, 0,
    14.5, 0,
    15, 0,
    -2.25, 15,
    -4.9500003, 7.5,
    -7.3500004, 0,
    17.25, 15,
    19.95, 7.5,
    22.35, 0
};

float lbl_1_data_5E8[2][3] = {
    0, 0, 0.5,
    0, 0.5, 0
};

GXColor lbl_1_data_600 = { 80, 80, 80, 80 };

Vec lbl_1_data_604[9] = {
    -1500,  0, -5000,
    0,  0,  -5000,
    1500,  0,  -5000,
    -1500,  0,  -3000,
    0,  0,  -3000,
    1500,  0,  -3000,
    -1500,  0,  1000,
    0,  0,  1000,
    1500,  0,  1000
};

GXColor lbl_1_data_670[9] = {
    { 255, 255, 255, 0 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 255 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 255 },
    { 255, 255, 255, 0 },
};

