mariopartyrd/marioparty4/src/REL/m455Dll/stage.c
void fn_1_6C60(OMOBJ *object)
{
    Work6914 *work = object->data;
    ANIMDATA *anim = work->unk10;
    anim->useNum = 0;
    HuSprAnimKill(anim);
}

s32 fn_1_6CB0(Vec *arg0, float arg1)
{
    Work6914 *work = lbl_1_bss_68->data;
    s32 i;
    HU3DMODEL *temp_r27;
    HU3DPARTICLE *temp_r28;
    HU3DPARTICLEDATA *temp_r30;

    for(i=0; i<8; i++, work++) {
        if(work->unk8 == 0) {
            break;
        }
    }
    if(i >= 8) {
        return -1;
    }
    Hu3DModelAttrReset(work->unk4, HU3D_ATTR_DISPOFF);
    work->unk8 = 1;
    work->unkC = 0;
    temp_r27 = &Hu3DData[work->unk4];
    temp_r28 = temp_r27->hookData;
    temp_r28->blendMode = 1;
    temp_r30 = temp_r28->data;
    for(i=0; i<temp_r28->maxCnt; i++, temp_r30++) {
        float temp_f30 = ((s32)frand()%20)+90;
        float temp_f29 = (s32)frand()%360;
        float temp_f26 = sind(temp_f30);
        float temp_f28 = cosd(temp_f30);
        float temp_f25 = 0.75f+0.15f*(0.007874016f*((s32)frand() & 0x7F));
        float temp_f31 = 0.15f;
        temp_r30->vel.x = temp_f31*(0.65f*(50.0*(temp_f28*sind(temp_f29))));
        temp_r30->vel.z = temp_f31*(0.65f*(50.0*(temp_f28*cosd(temp_f29))));
        temp_r30->vel.y = temp_f31*(50*temp_f26*temp_f25);
        temp_r30->time = 0;
        temp_r30->parManId = ((s32)frand()%16)+45;
        temp_r30->zRot = (s32)frand()%360;
        temp_r30->scale = 145;
        temp_r30->pos.x = 0.05f*(((s32)frand() & 0x7F)-64);
        temp_r30->pos.y = 0.65f*(((s32)frand() & 0x7F)-64);
        temp_r30->pos.z = 0.05f*(((s32)frand() & 0x7F)-64);
        temp_r30->color.r = ((s32)frand()%64)+192;
        temp_r30->color.g = ((s32)frand()%64)+192;
        temp_r30->color.b = ((s32)frand()%64)+192;
        temp_r30->color.a = 64;
    }
    if(arg1 < 0.0f) {
        arg1 = 1.0f;
    }
    work->unk14 = *arg0;
    work->unk20.x = work->unk20.y = work->unk20.z = 0;
    work->unk2C.x = work->unk2C.y = work->unk2C.z = arg1;
    Hu3DModelPosSet(work->unk4, work->unk14.x, work->unk14.y, work->unk14.z);
    Hu3DModelRotSet(work->unk4, work->unk20.x, work->unk20.y, work->unk20.z);
    Hu3DModelScaleSet(work->unk4, work->unk2C.x, work->unk2C.y, work->unk2C.z);
    return i;
}

void fn_1_7368(OMOBJ *object);

void fn_1_7280(OMOBJ *object)
{
    s32 i;
    for(i=0; i<object->mdlcnt; i++) {
        if(i == 0) {
            object->mdlId[i] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 9));
        } else {
            object->mdlId[i] = Hu3DModelLink(object->mdlId[0]);
        }
        Hu3DModelCameraSet(object->mdlId[i], HU3D_CAM0);
        Hu3DModelLayerSet(object->mdlId[i], 6);
        Hu3DModelAttrSet(object->mdlId[i], HU3D_ATTR_DISPOFF);

    }
    object->stat |= 0x100;
    object->objFunc = fn_1_7368;
}

void fn_1_7368(OMOBJ *object)
{
    s32 i;
    for(i=0; i<object->mdlcnt; i++) {
        HU3DMODEL *modelP = &Hu3DData[object->mdlId[i]];
        if(!(modelP->attr & HU3D_ATTR_DISPOFF)) {
           if(Hu3DMotionTimeGet(object->mdlId[i]) >= Hu3DMotionMaxTimeGet(object->mdlId[i])) {
               Hu3DModelAttrSet(object->mdlId[i], HU3D_ATTR_DISPOFF);
           }
        }
    }
}

void fn_1_7430(OMOBJ *object)
{

}

s32 fn_1_7434(Vec *pos, float scale)
{
    s32 i;
    for(i=0; i<lbl_1_bss_64->mdlcnt; i++) {
        HU3DMODEL *modelP = &Hu3DData[lbl_1_bss_64->mdlId[i]];
        if(modelP->attr & HU3D_ATTR_DISPOFF) {
            break;
        }
    }
    if(i >= lbl_1_bss_64->mdlcnt) {
        return -1;
    }
    Hu3DMotionTimeSet(lbl_1_bss_64->mdlId[i], 0);
    Hu3DMotionSpeedSet(lbl_1_bss_64->mdlId[i], 1);
    Hu3DModelPosSet(lbl_1_bss_64->mdlId[i], pos->x, pos->y, pos->z);
    Hu3DModelScaleSet(lbl_1_bss_64->mdlId[i], scale, scale, scale);
    Hu3DModelAttrReset(lbl_1_bss_64->mdlId[i], HU3D_ATTR_DISPOFF);
    return i;
}

void fn_1_76B0(OMOBJ *object);

void fn_1_75C0(OMOBJ *object)
{
    HU3DPARTICLE *temp_r30;
    HU3DPARTICLEDATA *temp_r29;
    s32 i;
    HU3DMODEL *modelP;
    ANIMDATA *anim = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 26), MEMORY_DEFAULT_NUM));

    object->data = anim;
    object->mdlId[0] = Hu3DParticleCreate(anim, 64);
    Hu3DModelCameraSet(object->mdlId[0], HU3D_CAM0);
    Hu3DModelLayerSet(object->mdlId[0], 3);
    Hu3DModelAttrReset(object->mdlId[0], HU3D_ATTR_PARTICLE_KILL);
    modelP = &Hu3DData[object->mdlId[0]];
    temp_r30 = modelP->hookData;
    temp_r29 = temp_r30->data;
    temp_r30->blendMode = 1;
    for(i=0; i<temp_r30->maxCnt; i++, temp_r29++) {
        temp_r29->scale = 0;
    }
    object->objFunc = fn_1_76B0;
}

void fn_1_76B0(OMOBJ *object)
{
    HU3DMODEL *modelP = &Hu3DData[object->mdlId[0]];
    HU3DPARTICLE *temp_r29 = modelP->hookData;
    HU3DPARTICLEDATA *temp_r30 = temp_r29->data;
    s32 i;
    for(i=0; i<temp_r29->maxCnt; i++, temp_r30++) {
        if(temp_r30->scale <= 0.0f) {
            continue;
        }
        if(++temp_r30->time > 360) {
            temp_r30->time -= 360;
        }
        temp_r30->pos.x += temp_r30->vel.x*sind(2.0f*temp_r30->time);
        temp_r30->pos.y += temp_r30->vel.y;
        if(temp_r30->pos.y >= 0.0f) {
            fn_1_6698(&temp_r30->pos, 0.00625f*temp_r30->scale, 1, REFRESH_RATE / 4);
            temp_r30->scale = 0;
        }

    }
}

void fn_1_7974(OMOBJ *object)
{
    ANIMDATA *anim = object->data;
    HuSprAnimKill(anim);
    Hu3DModelKill(object->mdlId[0]);
    object->mdlId[0] = -1;
}

s32 fn_1_79C8(Vec *pos, float scale)
{
    s32 i;
    HU3DMODEL *modelP = &Hu3DData[lbl_1_bss_60->mdlId[0]];
    HU3DPARTICLE *temp_r30 = modelP->hookData;
    HU3DPARTICLEDATA *temp_r31 = temp_r30->data;
    for(i=0; i<temp_r30->maxCnt; i++, temp_r31++) {
        if(temp_r31->scale <= 0.0f) {
            break;
        }
    }
    if(i >= temp_r30->maxCnt) {
        return -1;
    }
    if(scale <= 0.0f) {
        scale = 1.0f;
    }
    temp_r31->pos = *pos;
#if VERSION_PAL
    temp_r31->vel.x = 1.2f * (1.5f+(0.2f*(0.007874016f*((s32)frand() & 0x7F)))) * 0.5f;
    temp_r31->vel.z = 1.2f * (1.5f+(0.2f*(0.007874016f*((s32)frand() & 0x7F))));
    temp_r31->vel.y = 1.2f * (1.5f+(0.2f*(0.007874016f*((s32)frand() & 0x7F)))) * 2.0f;
#else
    temp_r31->vel.x = (1.5f+(0.2f*(0.007874016f*((s32)frand() & 0x7F))))*0.5f;
    temp_r31->vel.z = (1.5f+(0.2f*(0.007874016f*((s32)frand() & 0x7F))));
    temp_r31->vel.y = (1.5f+(0.2f*(0.007874016f*((s32)frand() & 0x7F))))*2.0f;
#endif
    temp_r31->time = (s32)frand()%360;
    temp_r31->scale = 20*scale;
    return i;
}


typedef struct work7C48 {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    float unkC;
    float unk10;
    Vec unk14;
    Vec unk20;
} Work7C48;

void fn_1_8050(OMOBJ *object);

