mariopartyrd/marioparty4/src/REL/m455Dll/stage.c
void fn_1_7C48(OMOBJ *object)
{
    Work7C48 *workBase = object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(Work7C48)*8, MEMORY_DEFAULT_NUM);
    Work7C48 *workP = workBase;
    s32 i;
    memset(workP, 0, 8*sizeof(Work7C48));
    for(i=0; i<8; i++, workP++) {
        switch(i) {
            case 0:
                workP->unk0 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 10));
                break;

            case 1:
                workP->unk0 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 10));
                break;

            default:
                if(i & 0x1) {
                    workP->unk0 = Hu3DModelLink(workBase[0].unk0);
                } else {
                    workP->unk0 = Hu3DModelLink(workBase[1].unk0);
                }
                break;
        }
        Hu3DModelScaleSet(workP->unk0, 0.5f, 0.5f, 0.5f);
        Hu3DModelCameraSet(workP->unk0, HU3D_CAM0);
        Hu3DModelLayerSet(workP->unk0, 1);
        workP->unk4 = 0;
        workP->unk8 = 0;
        workP->unkC = 2;
        workP->unk10 = (s32)frand() % 360;
        workP->unk14.x = 1500*((0.007874016f*((s32)frand() & 0x7F))-0.5f);
        workP->unk14.z = 500*((0.007874016f*((s32)frand() & 0x7F))-0.5f);
        workP->unk14.y = -250+(100*(0.3f*i));
        workP->unk20.x = 1500*((0.007874016f*((s32)frand() & 0x7F))-0.5f);
        workP->unk20.z = 500*((0.007874016f*((s32)frand() & 0x7F))-0.5f);
        workP->unk20.y = workP->unk14.y;
        Hu3DModelPosSet(workP->unk0, workP->unk14.x, workP->unk14.y, workP->unk14.z);
        Hu3DModelRotSet(workP->unk0, 0, workP->unk10, 0);
    }
    object->objFunc = fn_1_8050;
}

float fn_1_9F18(float start, float end, float weight);

void fn_1_8050(OMOBJ *object)
{
    Work7C48 *workP = object->data;
    s32 i;
    for(i=0; i<8; i++, workP++) {
        float dx;
        float dz;
        float vel;
        float angle;
        if(workP->unk4 == 0) {
            vel = 1+(0.5*sind((workP->unk8*5)%180));
        } else {
            vel = 3;
        }
#if VERSION_PAL
        workP->unk14.x += vel * (workP->unkC * sind(workP->unk10)) * 1.2f;
        workP->unk14.z += vel * (workP->unkC * cosd(workP->unk10)) * 1.2f;
#else
        workP->unk14.x += vel*(workP->unkC*sind(workP->unk10));
        workP->unk14.z += vel*(workP->unkC*cosd(workP->unk10));
#endif
        dx = workP->unk20.x-workP->unk14.x;
        dz = workP->unk20.z-workP->unk14.z;
        angle = atan2d(dx, dz);
        workP->unk10 = fn_1_9F18(angle, workP->unk10, 3.5f);
        if((dx*dx)+(dz*dz) < 10000.0f) {
            if(workP->unk4 == 0) {
                workP->unk20.x = 2000*((0.007874016f*((s32)frand() & 0x7F))-0.5f);
                workP->unk20.z = 700*((0.007874016f*((s32)frand() & 0x7F))-0.5f);
                workP->unk20.y = workP->unk14.y;
            } else {
                if(workP->unk14.x < 0.0f) {
                    workP->unk20.x = -2500;
                } else {
                    workP->unk20.x = 2500;
                }
                workP->unk20.z = 500*((0.007874016f*((s32)frand() & 0x7F))-0.5f);
                workP->unk20.y = workP->unk14.y;
            }
        }
        Hu3DModelPosSet(workP->unk0, workP->unk14.x, workP->unk14.y, workP->unk14.z);
        Hu3DModelRotSet(workP->unk0, 0, workP->unk10, 0);
        workP->unk8 += frand()&0x3;
    }
}

void fn_1_8474(OMOBJ *object)
{

}

void fn_1_8478(void)
{
    Work7C48 *workP = lbl_1_bss_5C->data;
    s32 i;
    for(i=0; i<8; i++, workP++) {
        workP->unk4 = 1;
        if(workP->unk14.x < 0.0f) {
            workP->unk20.x = -2500;
        } else {
            workP->unk20.x = 2500;
        }
        workP->unk20.z = 500*((0.007874016f*((s32)frand() & 0x7F))-0.5f);
        workP->unk20.y = workP->unk14.y;
    }
}

typedef struct work891C {
    s16 unk0;
    s16 unk2[2];
    s16 unk6;
    Vec unk8;
    Vec unk14;
    float unk20;
    float unk24;
    float unk28;
    float unk2C;
    float unk30;
    float unk34;
    float unk38;
    float unk3C;
} Work891C;

void fn_1_8578(OMOBJ *object, Work891C *workP)
{
    s32 num = workP[0].unk6;
    float ofsZ = -2000;
    s32 i;
    for(i=0; i<num; i++, workP++) {
        Mtx *modelMtx;
        Mtx rotZ;
        Hu3DModelPosSet(workP->unk0, workP->unk8.x, workP->unk8.y, workP->unk8.z+ofsZ);
        modelMtx = &Hu3DData[workP->unk0].mtx;
        MTXRotDeg(*modelMtx, 'Y', workP->unk28);
        MTXRotDeg(rotZ, 'Z', workP->unk38);
        MTXConcat(*modelMtx, rotZ, *modelMtx);
        Hu3DModelAttrReset(workP->unk0, HU3D_ATTR_DISPOFF);
    }
}

float fn_1_8D90(float start, float end, float weight);

void fn_1_867C(OMOBJ *object)
{
    Work891C *workP = object->data;
    s32 num = workP[0].unk6;
    s32 i;
    for(i=0; i<num; i++, workP++) {
        Vec diff;
        s32  unk8 = 0;
        VECSubtract(&workP->unk14, &workP->unk8, &diff);
        workP->unk2C = atan2d(diff.x, diff.z);
        workP->unk28 = fn_1_8D90(workP->unk28, workP->unk2C+workP->unk3C, 0.08f);
        workP->unk24 += 0.05f*(600.0f-workP->unk24);
        workP->unk20 += 0.2f*(workP->unk24-workP->unk20);
        workP->unk8.x += (workP->unk20*REFRESH_FREQ)*sind(workP->unk28);
        workP->unk8.z += (workP->unk20*REFRESH_FREQ)*cosd(workP->unk28);
        workP->unk30 += workP->unk20*REFRESH_FREQ;
    }
    fn_1_8578(object, object->data);

}

void fn_1_891C(OMOBJ *object)
{
    s16 num = 12;
    Work891C *workBase;
    s32 modelId;
    Work891C *work;
    float radius;
    float angle;
    float ofsZ;
    s32 i;
    object->data = workBase = HuMemDirectMallocNum(HEAP_SYSTEM, num*sizeof(Work891C), MEMORY_DEFAULT_NUM);
    memset(workBase, 0, num*sizeof(Work891C));
    modelId = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 8));
    ofsZ = 1500;
    work = workBase;
    for(i=0; i<num; i++, work++) {

        work->unk0 = Hu3DModelLink(modelId);
        Hu3DModelLayerSet(work->unk0, 6);
        Hu3DModelCameraSet(work->unk0, 1);
        Hu3DModelScaleSet(work->unk0, 7, 7, 7);
        work->unk14.x = ((s32)frandmod(1000)*4.0f)-2000;
        work->unk14.z = ((s32)frandmod(1000))-500.0f;
        work->unk14.y = ((s32)frandmod(1000)*0.8f)+300;
        angle = (s32)frandmod(360);
        radius = ((s32)frandmod(250))+200.0f;
        work->unk8.x = radius*sind(angle);
        work->unk8.y = 0;
        work->unk8.z = radius*cosd(angle);
        VECAdd(&work->unk14, &work->unk8, &work->unk8);
        work->unk38 = 60-((6.0f/55.0f)*radius);
        work->unk28 = (s32)frandmod(360);

        work->unk3C = ((s32)frandmod(1000) < 500) ? (-70.0f+((s32)frandmod(50)*0.1f)) : (70.0f-((s32)frandmod(50)*0.1f));
        if(work->unk3C < 0.0f) {
            work->unk38 = -work->unk38;
        }
        work->unk30 = 1;
        work->unk34 = 0;
        ofsZ -= 50.0f;
        work->unk6 = num;
    }
    Hu3DModelKill(modelId);
    object->objFunc = fn_1_867C;
}

float fn_1_8D90(float start, float end, float weight)
{
    float angle = fmodf(end-start, 360);
    if(angle < 0.0f) {
        angle += 360.0f;
    }
    if(angle > 180.0f) {
        angle -= 360.0f;
    }
    angle = fmodf(start+(weight*angle), 360);
    if(angle < 0.0f) {
        angle += 360.0f;
    }
    return angle;
}

void fn_1_91B8(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);

