mariopartyrd/marioparty4/src/REL/m455Dll/stage.c
void fn_1_8EAC(void)
{
    StructBss48 *workP = lbl_1_bss_48 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(StructBss48), MEMORY_DEFAULT_NUM);
    HU3DPARTICLE *particle;
    HU3DMODEL *modelP;
    s16 *newWork;
    s32 modelId;
    memset(workP, 0, sizeof(StructBss48));
    workP->unk0[0] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 13), MEMORY_DEFAULT_NUM));
    workP->unk0[1] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 14), MEMORY_DEFAULT_NUM));
    workP->unk0[2] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 15), MEMORY_DEFAULT_NUM));
    workP->unk0[3] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 16), MEMORY_DEFAULT_NUM));
    workP->unk20.y = 1;
    workP->unk20.z = 0;
    workP->unk10[0] = modelId = Hu3DParticleCreate(workP->unk0[0], 1);
    Hu3DModelLayerSet(modelId, 6);
    modelP = &Hu3DData[modelId];
    particle = modelP->hookData;
    particle->blendMode = 1;
    particle->hook = fn_1_91B8;
    newWork = particle->work = HuMemDirectMallocNum(HEAP_DATA, sizeof(s16)*4, modelP->mallocNo);
    memset(newWork, 0, 4*sizeof(s16));
    newWork[1] = 0;
    workP->unk10[1] = modelId = Hu3DParticleCreate(workP->unk0[3], 10);
    Hu3DModelLayerSet(modelId, 6);
    modelP = &Hu3DData[modelId];
    particle = modelP->hookData;
    particle->blendMode = 1;
    particle->hook = fn_1_91B8;
    newWork = particle->work = HuMemDirectMallocNum(HEAP_DATA, sizeof(s16)*4, modelP->mallocNo);
    memset(newWork, 0, 4*sizeof(s16));
    newWork[1] = 1;
    workP->unk10[2] = modelId = Hu3DParticleCreate(workP->unk0[2], 4);
    Hu3DModelLayerSet(modelId, 6);
    modelP = &Hu3DData[modelId];
    particle = modelP->hookData;
    particle->blendMode = 1;
    particle->hook = fn_1_91B8;
    newWork = particle->work = HuMemDirectMallocNum(HEAP_DATA, sizeof(s16)*4, modelP->mallocNo);
    memset(newWork, 0, 4*sizeof(s16));
    newWork[1] = 2;
    workP->unk10[3] = modelId = Hu3DParticleCreate(workP->unk0[1], 6);
    Hu3DModelLayerSet(modelId, 6);
    modelP = &Hu3DData[modelId];
    particle = modelP->hookData;
    particle->blendMode = 1;
    particle->hook = fn_1_91B8;
    newWork = particle->work = HuMemDirectMallocNum(HEAP_DATA, sizeof(s16)*4, modelP->mallocNo);
    memset(newWork, 0, 4*sizeof(s16));
    newWork[1] = 3;
}

void fn_1_9168(void)
{
    StructBss48 *workP = lbl_1_bss_48;
#ifndef NON_MATCHING
    // these already get freed in HuSprAnimKill by hsfman.c
    HuSprAnimKill(workP->unk0[0]);
    HuSprAnimKill(workP->unk0[1]);
    HuSprAnimKill(workP->unk0[2]);
    HuSprAnimKill(workP->unk0[3]);
#endif
}

float lbl_1_data_6A0[4] = {
    1000,
    200,
    600,
    1200
};

float lbl_1_data_6B0[4] = {
    1,
    0.6,
    0.3,
    0.425
};

void fn_1_91B8(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    s16 unk8 = 0;
    StructBss48 *workP = lbl_1_bss_48;
    s16 *newWorkP = particle->work;
    s32 unk14 = 0;
    Vec pos = Center;
    Vec rot = CRot;
    float temp_f26;
    float temp_f25;
    float zoom = CZoom;
    HU3DPARTICLEDATA *temp_r31;
    Vec sp3C;
    Vec sp30;
    Vec sp24;
    Vec sp18;
    float temp_f29;
    float temp_f23;
    s32 i;
    switch(newWorkP[2]) {
        case 0:
            temp_r31 = particle->data;
            if(newWorkP[1]) {
                sp18.x = 2000;
                sp18.y = -300;
                sp18.z = 500;
                temp_f29 = 1/VECMagPoint(sp18.x, sp18.y, sp18.z);
                sp18.x *= temp_f29;
                sp18.y *= temp_f29;
                sp18.z *= temp_f29;
                temp_f23 = 3200.0f/particle->maxCnt;
                for(i=0; i<particle->maxCnt; i++, temp_r31++) {
                    temp_f26 = 500.0+((temp_f23*i)+((0.25f*temp_f23)*((float)((s32)frand() & 0xFFFF)*0.0000152587890625)));
                    temp_f25 = temp_f26/3200;
                    temp_r31->accel.x = temp_f26;
                    temp_r31->pos.x = 1000+(temp_f26*sp18.x);
                    temp_r31->pos.y = 4800+(temp_f26*sp18.y);
                    temp_r31->pos.z = -3500+(temp_f26*sp18.z);
                    temp_r31->scale = ((0.7f*(temp_f25*temp_f25))+0.3f)*(lbl_1_data_6A0[newWorkP[1]]*(0.7f+(0.3f*((float)((s32)frand() & 0xFFFF)*0.0000152587890625))));
                    temp_r31->color.r = (s32)(((float)((s32)frand() & 0xFFFF)*0.0000152587890625)*160.0)+32;
                    temp_r31->color.g = (s32)(((float)((s32)frand() & 0xFFFF)*0.0000152587890625)*96.0)+32;
                    temp_r31->color.b = (s32)(((float)((s32)frand() & 0xFFFF)*0.0000152587890625)*128.0)+32;
                    temp_r31->color.a = (255*lbl_1_data_6B0[newWorkP[1]]*(1.0-(0.4*temp_f25)))-(s32)(((float)((s32)frand() & 0xFFFF)*0.0000152587890625)*16.0);
                    temp_r31->accel.z = temp_r31->color.a;
                }
                newWorkP[2]++;
            } else {
                temp_r31->pos.x = 1000;
                temp_r31->pos.y = 4800;
                temp_r31->pos.z = -3500;
                temp_r31->scale = 1000;
            }
            break;

        case 1:
            sp3C.x = sind(rot.y)*cosd(rot.x);
            sp3C.y = -sind(rot.x);
            sp3C.z = cosd(rot.y)*cosd(rot.x);
            sp30.x = 1000-(pos.x+(1.25f*(sp3C.x*zoom)));
            sp30.y = 4800-(pos.y+(sp3C.y*zoom));
            sp30.z = -3500-(pos.z+(1.25f*(sp3C.z*zoom)));
            temp_f29 = 1/VECMagPoint(sp30.x, sp30.y, sp30.z);
            sp30.x *= temp_f29;
            sp30.y *= temp_f29;
            sp30.z *= temp_f29;
            temp_f29 = -((-sp30.x*-sp3C.x)+(-sp30.y*-sp3C.y)+(-sp30.z*-sp3C.z));
            sp24.x = -sp3C.x+((-2.0f*sp30.x)*temp_f29);
            sp24.y = -sp3C.y+((-2.0f*sp30.y)*temp_f29);
            sp24.z = -sp3C.z+((-2.0f*sp30.z)*temp_f29);
            temp_r31 = particle->data;
            for(i=0; i<particle->maxCnt; i++, temp_r31++) {
                temp_r31->pos.x = 1000+(sp24.x*temp_r31->accel.x);
                temp_r31->pos.y = 4800+(sp24.y*temp_r31->accel.x);
                temp_r31->pos.z = -3500+(sp24.z*temp_r31->accel.x);
                temp_r31->color.a = temp_r31->accel.z*workP->unk20.y;
            }
            break;
    }
    DCFlushRange(particle->data, particle->maxCnt*sizeof(HU3DPARTICLEDATA));
    
