mariopartyrd/marioparty4/src/REL/m455Dll/stage.c
}

void fn_1_9CFC(float arg0)
{
    StructBss48 *workP = lbl_1_bss_48;
    workP->unk20.y = arg0;
    if(workP->unk20.y > 1.0f) {
        workP->unk20.y = 1.0f;
    }
    if(workP->unk20.y <= 0.0f) {
        Hu3DModelAttrSet(workP->unk10[0], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(workP->unk10[1], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(workP->unk10[2], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(workP->unk10[3], HU3D_ATTR_DISPOFF);
    } else {
        Hu3DModelAttrReset(workP->unk10[0], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrReset(workP->unk10[1], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrReset(workP->unk10[2], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrReset(workP->unk10[3], HU3D_ATTR_DISPOFF);
    }
}

float fn_1_9E00(float start, float end)
{
    float angleDiff;
    if(start >= 360.0f) {
        start -= 360.0f;
    } else if(start < 0.0f) {
        start += 360.0f;
    }
    if(end >= 360.0f) {
        end -= 360.0f;
    } else if(end < 0.0f) {
        end += 360.0f;
    }
    angleDiff = start-end;
    if(angleDiff <= -180.0f) {
        angleDiff += 360.0f;
    } else if(angleDiff >= 180.0f) {
        angleDiff -= 360.0f;
    }
    return angleDiff;
}

float fn_1_9F18(float start, float end, float max)
{
    float angle;
    float diff;
    
    if(start >= 360.0) {
        start -= 360.0;
    } else if(start < 0.0) {
        start += 360.0;
    }
    if(end >= 360.0) {
        end -= 360.0;
    } else if(end < 0.0) {
        end += 360.0;
    }
    diff = 360.0+(start-end);
    if(fabs(diff) >= 360.0) {
        diff = fmod(diff, 360.0);
    }
    if(diff < 180.0) {
        if(diff <= max) {
            angle = diff;
        } else {
            angle = max;
        }
    } else if(360.0-diff <= max) {
        angle = -(360.0-diff);
    } else {
        angle = -max;
    }
    angle += end;
    if(angle >= 360.0) {
        angle -= 360.0;
    } else if(angle < 0.0) {
        angle += 360.0;
    }
    
    return angle;
}
